# CannotChangeWorkplaneVisibility Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotChangeWorkplaneVisibility Property
BuiltInFailures..::..SketchFailures Class See Also
---
Can't change Work Plane Visibility.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotChangeWorkplaneVisibility { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotChangeWorkplaneVisibility As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotChangeWorkplaneVisibility {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace